In [1]:
import sqlite3
import pandas as pd

In [ ]:
data = {
    'title': ['Inception', 'Interstellar', 'The Matrix'],
    'year': [2010, 2014, 1999],
    'score': [8.8, 8.6, 8.7]
}

df = pd.DataFrame(data)

In [4]:
# Create or connect to a SQLite database
conn = sqlite3.connect('movies.db')

# Save the DataFrame to a table named 'movies'
df.to_sql('movies', conn, if_exists='replace', index=False)

# Save the DataFrame to a table named 'movies'
df.to_sql('movies2', conn, if_exists='replace', index=False)

# Optional: Close the connection
conn.close()

In [2]:
# Reconnect and read the table back into a DataFrame
conn = sqlite3.connect('movies.db')
df_loaded = pd.read_sql('SELECT * FROM movies', conn)
print(df_loaded)
conn.close()

          title  year  score
0     Inception  2010    8.8
1  Interstellar  2014    8.6
2    The Matrix  1999    8.7

In [9]:
import datetime
# Prepare metadata
timestamp = datetime.datetime.now().strftime("%Y-%m-%d %I:%M:%S %p")

print(timestamp)

2025-04-10 09:54:09 PM

In [5]:
import sqlite3
import pandas as pd

# Connect to your SQLite database
conn = sqlite3.connect("data/drone_data.db")
cursor = conn.cursor()

# 1. List all tables in the database
cursor.execute("SELECT name FROM sqlite_master WHERE type='table';")
tables = cursor.fetchall()
print("Tables in the database:")
for t in tables:
    print("-", t[0])  # t is a tuple like ('table_name',)

# 2. Read contents of each table
for t in tables:
    table_name = t[0]
    print(f"\n--- Contents of table: {table_name} ---")
    df = pd.read_sql_query(f"SELECT * FROM '{table_name}'", conn)
    display(df)  # Show only the first few rows

Tables in the database:
- e30ce5de_7e0b_413a_af2a_5c3aeea5756f
- metadata
- 27e59f90_292f_492b_bc7a_2345fb8fd200
- 82efe6dd_a6cb_4c45_a240_2b0d2e2dbccc
- 5dc8901d_702a_4e2c_b22f_38a7abf24ab9
- 361c9938_7a44_40c7_beb1_1e024e95f7a9
- d1412f36_7b39_4dce_9c9c_c421d9254e7a
- 0152c24a_3ab0_4355_b11d_e3b06933398e
- 3e72def8_50fb_4563_a549_5a1df2b9fd61
- fb2909e6_d727_4bb1_b120_37e681097a7d

--- Contents of table: e30ce5de_7e0b_413a_af2a_5c3aeea5756f ---

   Seconds Height    Speed
0        1   5 ft  0.5 m/s
1        2   5 ft  0.6 m/s
2        3   6 ft  0.7 m/s
3        4   6 ft  0.8 m/s
4        5   6 ft  0.9 m/s
5        6   7 ft  1.0 m/s
6        7   7 ft  1.1 m/s
7        8   8 ft  1.2 m/s
8        9   9 ft  1.3 m/s
9       10   9 ft  1.4 m/s
10      11  10 ft  1.5 m/s
11      12  10 ft  1.6 m/s

--- Contents of table: metadata ---

,table_name,timestamp,image
0,e30ce5de_7e0b_413a_af2a_5c3aeea5756f,2025-04-10 09:58:45 PM,b'\x89PNG\r\n\x1a\n\x00\x00\x00\rIHDR\x00\x00\...
1,27e59f90_292f_492b_bc7a_2345fb8fd200,2025-04-10 09:59:44 PM,b'\x89PNG\r\n\x1a\n\x00\x00\x00\rIHDR\x00\x00\...
2,82efe6dd_a6cb_4c45_a240_2b0d2e2dbccc,2025-04-11 01:17:44 AM,b'\x89PNG\r\n\x1a\n\x00\x00\x00\rIHDR\x00\x00\...
3,5dc8901d_702a_4e2c_b22f_38a7abf24ab9,2025-04-11 01:20:12 AM,b'\x89PNG\r\n\x1a\n\x00\x00\x00\rIHDR\x00\x00\...
4,361c9938_7a44_40c7_beb1_1e024e95f7a9,2025-04-11 01:22:33 AM,b'\x89PNG\r\n\x1a\n\x00\x00\x00\rIHDR\x00\x00\...
5,d1412f36_7b39_4dce_9c9c_c421d9254e7a,2025-04-11 01:24:08 AM,b'\x89PNG\r\n\x1a\n\x00\x00\x00\rIHDR\x00\x00\...
6,0152c24a_3ab0_4355_b11d_e3b06933398e,2025-04-11 01:38:52 AM,b'\x89PNG\r\n\x1a\n\x00\x00\x00\rIHDR\x00\x00\...
7,3e72def8_50fb_4563_a549_5a1df2b9fd61,2025-04-11 01:42:02 AM,b'\x89PNG\r\n\x1a\n\x00\x00\x00\rIHDR\x00\x00\...
8,fb2909e6_d727_4bb1_b120_37e681097a7d,2025-04-11 01:42:17 AM,b'\x89PNG\r\n\x1a\n\x00\x00\x00\rIHDR\x00\x00\...

--- Contents of table: 27e59f90_292f_492b_bc7a_2345fb8fd200 ---

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   22
3    Diana   28
4    Ethan   35

--- Contents of table: 82efe6dd_a6cb_4c45_a240_2b0d2e2dbccc ---

   Seconds Height    Speed
0        1   5 ft  0.5 m/s
1        2   5 ft  0.6 m/s
2        3   6 ft  0.7 m/s
3        4   6 ft  0.8 m/s
4        5   6 ft  0.9 m/s
5        6   7 ft  1.0 m/s
6        7   7 ft  1.1 m/s
7        8   8 ft  1.2 m/s
8        9   9 ft  1.3 m/s
9       10   9 ft  1.4 m/s
10      11  10 ft  1.5 m/s
11      12  10 ft  1.6 m/s

--- Contents of table: 5dc8901d_702a_4e2c_b22f_38a7abf24ab9 ---

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   22
3    Diana   28
4    Ethan   35

--- Contents of table: 361c9938_7a44_40c7_beb1_1e024e95f7a9 ---

   Seconds Height    Speed
0        1   5 ft  0.5 m/s
1        2   5 ft  0.6 m/s
2        3   6 ft  0.7 m/s
3        4   6 ft  0.8 m/s
4        5   6 ft  0.9 m/s
5        6   7 ft  1.0 m/s
6        7   7 ft  1.1 m/s
7        8   8 ft  1.2 m/s
8        9   9 ft  1.3 m/s
9       10   9 ft  1.4 m/s
10      11  10 ft  1.5 m/s
11      12  10 ft  1.6 m/s

--- Contents of table: d1412f36_7b39_4dce_9c9c_c421d9254e7a ---

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   22
3    Diana   28
4    Ethan   35

--- Contents of table: 0152c24a_3ab0_4355_b11d_e3b06933398e ---

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   22
3    Diana   28
4    Ethan   35

--- Contents of table: 3e72def8_50fb_4563_a549_5a1df2b9fd61 ---

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   22
3    Diana   28
4    Ethan   35

--- Contents of table: fb2909e6_d727_4bb1_b120_37e681097a7d ---

   Seconds Height    Speed
0        1   5 ft  0.5 m/s
1        2   5 ft  0.6 m/s
2        3   6 ft  0.7 m/s
3        4   6 ft  0.8 m/s
4        5   6 ft  0.9 m/s
5        6   7 ft  1.0 m/s
6        7   7 ft  1.1 m/s
7        8   8 ft  1.2 m/s
8        9   9 ft  1.3 m/s
9       10   9 ft  1.4 m/s
10      11  10 ft  1.5 m/s
11      12  10 ft  1.6 m/s